window._phrases = { 
// Words
"welcome": "welcome",
"generate": "generate",
"password": "password",
"submit": "submit",
"reply": "reply",
"email": "email",
"compose": "compose",
"register": "register",
"registering": "registering",
"name": "name",
"or": "or",
"okay": "okay",
"back": "back",
"cancel": "cancel",
"back": "back",
"close": "close",
"error": "error",
"contacts": "contacts",
"to": "to",
"cc": "cc",
"bcc": "bcc",
"subject": "subject",
"send": "send",
"confirm": "confirm",
"invite": "invite",

// Short phrases
"are you sure": "Are you sure?",

"password mismatch": "Password mismatch",
"choose password": "Choose password",
"new password": "New password",
"change password": "Change password",
"current password": "Current password",
"confirm password": "Confirm password",

"enter your email": "Enter your email",
"log in": "Log in",
"logging in": "Logging in",
"error logging in": "Error logging in",

"import key": "Import key",
"revoke key": "Revoke key",
"generate new key": "Generate New Key",
"import private key": "Import Private Key",
"publish my key": "Publish my key",

"personal information": "Personal information",

"new contact": "New contact",
"add new contact": "Add new contact",
"save contact": "Save contact",
"save settings": "Save settings",
"revoke and delete": "Revoke and delete",
"destroy parley account": "Destroy Parley account",
"welcome to parley": "Welcome to Parley",
"parley settings": "Parley settings",

"send email": "Send email",
"loading inbox": "Loading inbox",
"refresh inbox": "Refresh inbox",
"reconnect inbox": "Reconnect inbox",
"auto refresh inbox": "Automatically refresh mailbox every 5 minutes.",
"inbox updates": "Inbox updates",

"invite users": "Invite users",

// Messages: setup
"message-installing": "Parley requires its own version of GPG. May we install it for you now? (It will take a minute or two.)",
"message-welcome": "Welcome to the Parley Pre-Beta! It's still obviously a work in progress, but we hope you find it useful and look forward to your feedback.",
"message-login": "Enter your password to access the magic of Parley!",
"message-login-wait": "Downloading encrypted keys and contacts from the Parley server...",
"message-register": "Register for Parley! Keep in mind, this will only work if you have already signed up for the service at http://parley.co",

"message-keygen": "To use encrypted email, you must have a <strong>secret key</strong>. If you have never used PGP encryption, select <strong>Generate New Key</strong> and the Parley client will set you up. If you have an existing key, I don't need to tell you to click <strong>Import Private Key</strong>.",
"message-keygen-confirm": "Do not generate a new key if you already have a public PGP key. If you do not have a public PGP key, or if you are unsure about it, generate yourself a new one! (You would know if you had one).",
"message-key-revoke": "Revoking your key will clear your user account with Parley along with revoking it from the public PGP key servers. Use with caution.",
"message-key-notfound": "Public PGP keys not found",
"message-key-sendpublic": "If you check the box below, the public key that the Parley client generates for you will be distributed to public PGP key servers. This isn't necessary for communicating with other Parley users, but it will make it much easier to interact with people who use PGP encryption outside of Parley. If you're unsure, just leave it unchecked for now. You can always publish your key at a later time.",
"message-key-revokesuccess": "We have successfully revoked your key and killed your account. Good bye!",
"message-key-revokeerror": "We have experienced some kind of error while killing your account. You can check out any time you want, but...",
"message-key-revokeconfirm": "Are you _sure_ that you want to revoke your key and permanently kill your account? We don't mean delete the way F---book does, we will actually remove the data from our servers (so that this Parley client is no longer able to access your email) and send out revocation certificates. (this tells all other PGP users that your public key is no longer valid, and they should not use it.)",
"message-nokey": "No public PGP key found for the following users.",

"message-import-key": "Paste your key in the box the below to import it into your Parley client.",
"message-register-wait": "Right now, we're generating your encryption keys and sending an encrypted version of them to the Parley server. It takes a little while; sorry about that. It may sound weird, but for once it will actually go faster if you move your mouse and use your keyboard while you wait - it increases system entropy during the key generation process.",

// Messages: inbox
"message-inbox-loading": "We are loading your inbox. This may take a minute or two, but again we will be able to improve that with the next release. Please be patient. Thanks! You are the best.",
"message-inbox-reconnect": "If you are unable to successfully refresh your inbox, there's a chance that we can fix it by generating some new tokens and what not for context.io.",

"message-message-sending": "Encrypting and sending...",
"message-message-sent": "Your message was encrypted and sent on its way!",

// Messages: contacts
"message-contacts-saving": "Please wait while we save your contacts to the server! Again, the encryption process takes some time, but we will be speeding it up with the next release.",

// Messages: settings
"message-settings-saveerror": "We have encountered an error trying to save your settings.",
"message-settings-saved": "Your personal settings have been updated.",
"message-settings-invalidname": "Please enter a valid name.",
"message-password-invalidpassword": "Please enter a valid password.",
"message-password-changeerror": "We encountered a strange error while trying to change your password.",
"message-password-changed": "Your password has been successfully changed from \"abcde\" to \"password\"",

// Messages: etc etc etc

// Errors
"error-register": "We encountered some type of registration error, but we're not totally sure exactly what happened. Are you sure that you have already signed up at <a href=\"https://parley.co/#signup\" target=\"registerWindow\">parley.co</a>?",
"error-login": "We have encountered an error trying to log you in to Parley. Is it possible that you mistyped your email, your password, or—though we do not want to assume this about our users—both your email and password? Go ahead and try again.",
"error-password-nomatch": "Your passwords don't match. Please retype one, or the other, or both.",
"error-inbox-forbidden": "We haven't been able to access your account through context.io yet. We'll keep trying, or click \"Retry\" below to change your settings with context.io.",
"error-email-novalid": "Please enter a valid email address.",
"error-message-notsent": "We encountered an error trying to send your message. Sorry for the inconvenience.",

// No trailing comma!
"":""}
